templates/dp-ntp-service.tmpl

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ma="http://www.datapower.com/schemas/management">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ma:request domain="default">
            <ma:set-config>
                <NTPService>
                    <mAdminState>enabled</mAdminState>
                    <UserSummary></UserSummary>
                    <RemoteServer>{{.NTPServer | default "pool.ntp.org"}}</RemoteServer>
                    <RefreshInterval>900</RefreshInterval>
                </NTPService>
            </ma:set-config>
        </ma:request>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
